AccumulationRegisters/ТоварыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

CommonModules/ДвижениеТоваров/Ext/Module.bsl
Функция РаспределениеТоваровПоСкладам(Параметры) Экспорт 
	
	МВТ = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос; 
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.УстановитьПараметр("ТЧ", Параметры.Товары);
	Запрос.УстановитьПараметр("Период", Параметры.Период);
	Запрос.УстановитьПараметр("Регистратор", Параметры.Регистратор);
	Запрос.УстановитьПараметр("Склад", Параметры.Склад);
	Запрос.УстановитьПараметр("Граница", Новый Граница(Параметры.Регистратор.МоментВремени(), ВидГраницы.Исключая));
	Запрос.Текст = "Выбрать * Поместить Распределить Из &ТЧ КАК ТЧ;";
	Запрос.Выполнить();
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Остатки.Склад КАК Склад,
	               |	Остатки.Номенклатура КАК Номенклатура,
	               |	Остатки.КоличествоОстаток КАК КоличествоОстаток Поместить ОстаткиСмежныхСкладов
	               |ИЗ
	               |	РегистрНакопления.ТоварыНаСкладах.Остатки(
	               |			&Граница,
	               |			Номенклатура В
	               |					(ВЫБРАТЬ
	               |						Отбор.Номенклатура
	               |					ИЗ
	               |						Распределелить КАК Отбор
	               |					СГРУППИРОВАТЬ ПО
	               |						Отбор.Номенклатура)
	               |				И НЕ Склад = &Склад) КАК Остатки";
	
	
	
	Возврат новый ТаблицаЗначений;
	
КонецФункции
